courses/principles-of-software-engineering/project/majstor-na-klik/Dokumentacija/Faza 5/app/Models/PorukaModel.php

    public function getAllReceivedMessages($IdTo){
        $poruke = $this->select('IdPos')
                    ->where("IdPri", $IdTo)
                    ->where("Status", 0)
                    ->orderBy("DatumVreme", "ASC")
                    ->findAll();
---
SELECT `IdPos`
FROM `poruka`
WHERE `IdPri` = '47'
AND `Status` = 0
ORDER BY `DatumVreme` ASC